SkyHostExtractor/xml_templates/createSequence.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
    <s:Header>
        <a:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2005/02/rm/CreateSequence</a:Action>
        <a:MessageID>urn:uuid:2090f1e9-23dd-4a2c-8b53-2ec43f343e3d</a:MessageID>
        <a:To s:mustUnderstand="1">http://www.skyhost.dk/soap/Basic.svc</a:To>
    </s:Header>
    <s:Body>
        <CreateSequence xmlns="http://schemas.xmlsoap.org/ws/2005/02/rm">
            <AcksTo>
                <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
            </AcksTo>
            <Offer>
                <Identifier>urn:uuid:10be108a-6533-48c5-b64d-515a87fca5c6</Identifier>
            </Offer>
        </CreateSequence>
    </s:Body>
</s:Envelope>